# # 首先:字典是通过键值对来存储数据的,
# # 也就是说是一对,一对存的
# # 存储一个是键,一个是值
# # 字典的表示方式{key:value,key2:value,key3:value}采用的此方式
#
# # dic = {"卡":"卡卡","莫":"莫莫"}
# # 输出整个字典包含键值对
# # print(dic)
# # 在字典中[]相当于列表中的索引,访问此键,返回此值
# # print(dic["卡"])
# # val = dic["莫"]
# # print(val)
#
# # 但字典对键值的存储分别有不同的要求
# # 字典的key(键)必须是可哈希的,这意味着是不可变的类型数据
# # value(值)可以放入任何数据类型
#
# # 示例
# # unhashable type: 'list' 出现报错,不可哈希列表
# # dic = {[]:"灭"}
#
# # 4.2字典的增删改查:
# # 空字典
# # dic = {}
# # dic = dict()
# # # dic['a'] = 1
# # # dic['b'] = 2
# # # dic['c'] = 3
# # # print(dic)
# # # dic['d'] = 4
# # # print(dic)
# #
# # # 增加
# # dic[1] = "名字"
# # dic[2] = "年龄"
# # dic["你好"] = "卡罗"
# # # print(dic)
# # print(dic[1])
#
# # 修改：此时字典中1已经有了相应的值
# # 但你在进行此操作时，出现了覆盖，也就是修改了此位置的数据
# # dic[1] = "无言"
# # print(dic)
#
# # 此为设置默认值，比如这个键并未被设置过
# # dic.setdefault("tom","咔嚓") # 以前没有才会生效
# # print(dic)
# # dic.setdefault("tom","咪咪") # 如果有了就不会生效
#
# # 删除操作：根据键来删除
# # 就和列表类似，
# # dic.pop(1)
# # print(dic)
# # 第二种删除
# # 不常用
# # del dic[1]
#
# # 查询：
# # print(dic)
# # print(dic[1])
# # print(dic[2])
# # 也可以进行
# # print(dic.get(1))
#
# # 如果key不存在，则程序报错
# # print(dic['你好11111111']) # 当你确定你的key是没问题的，可以用
# # 如果key不存在，则程序不报错 # 当你不确定你key存在的时候
# # 此不报错，返回None
# # print(dic.get('你好222222'))
#
# # None,py中的关键字,单纯就是空表示没有的含义
# # print(type(None))
# # 例如,此为空字符串，你可以使用其他相关的字符串操作，如字符串添加等
# # s = ""
#
# # 例子：
# dic = {
#     "莫言" : "我来了",
#     "咔嚓" : "他来了",
#     "魔力" : "你来了"
# }
#
# str = input("请输入你要查找的内容：")
# # 注意：采取了此种赋值的方式，若用户输入的内容不存在，
# # 其会强制根据不存在查询，但由于我的为dic[]查询所以会拨错
# # val = dic[str]
# # 而这种方式不会报错
# val = dic.get(str)
#
# if str in dic:
#     print(val)
# else:
#     print("并无您要查询的信息！")
