# # set集合:无序存储
# # []列表，()元组，{}set集合
# # s = {}
# # 填入元素后，为set类型
# # 注意,放入列表会报错，会出现不可哈希的报错
# # 原因在于py中set集合会对存储的数据进行哈希计算，
# # 然后根据计算出来的哈希值来进行存储
# # set集合必须要求存储的数据时可以哈希的
# # s = {1,2,3,4,5,6,7,8,9,"你好","无需",[]}
# # 我放入元组,并不报错,元组不可变
# # s = {1,2,3,4,5,6,7,8,9,"你好","无需",("单反")}
#
# # 可哈希:int,string等,不可变的数据类型
# # 不可哈希:list列表,期内是可以改变数据类型的.set集合也不行,dict字典也不可以
#
# # s = {1,2,3,4,5,6,7,8,9,"你好","无需"}
# # 可以看到为dict字典型
# # print(s)
# # print(type(s))
#
# # 可是我想创建空集合该怎么办?
# # 我使用此创建的是空字典
# # s = {}
# # 用此种方法创建的为空集合等
# # s = set()
# # s = list()
# # s = tuple()
# # s = str()
#
# s = {"你好","短视","卡哈"}
# # 集合添加:
# s.add("罗源")
# s.add("活了")
# # 可以看到其并未按顺序输出
# # print(s)
#
# # 此默认弹出的是最后一个
# # 但在列表中采用的是索引,但由于set集合无序
# # 所以基本不常用
# # s.pop()
#
# # 此为常用
# # 集合和三处
# # s.remove("你好")
# # print(s)
#
# # 列表中可以通过索引进行指定的修改
# # 但在set集合中,只能通过remove删除内容后,再新增才为修改
# # 例如:
# s.remove("活了")
# s.add("麻了")
# print(s)

# 还有内容,交集,并集,差集
# s1 = {"你好","我好","大家好"}
# s2 = {"怕了","错了","你好"}
# 输出了你好
# print(s1 & s2)
# 这也是取交集
# print(s1.intersection(s2))
# 此为并集
# print(s1 | s2)
# print(s1.union(s2))
# 差集
# print(s1 - s2)
# print(s1.difference(s2))

# 集合的重要作用,能去除重复
# s1 = {"张无忌","周芷若","赵敏"}
# print(s1)
# 我再次添加
# 会发现并未再次多一个张无忌
# s1.add("张无忌")
# print(s1)

# 我可以通过set集合来进行去除列表中的重复内容
# lst = ["张无忌","周芷若","赵敏","张无忌","周芷若","赵敏","张无忌","周芷若","赵敏","张无忌","周芷若","赵敏"]
# print(lst)
# 进行去重复,但是请记住,这会导致数据无序
# print(set(lst))
# 同样我们可以将其再变为lst
# 从输出的括号便可以看出
# print(list(set(lst)))
